import React from 'react';
import commons from '../../styles/common.module.css';
import styles from '../../styles/privacy/privacy.module.css';
import useDocumentTitle from '../../hooks/useDocumentTitle';

function TermsOfUse(props) {
   const { mainTitle } = useDocumentTitle();

   return (
      <>
         <div className={commons.container__box}>
            <h2 className={commons.main_title}>{mainTitle}</h2>
               
            <div className={styles.layout}>
               <div className={styles.text_layout}>
                  <p className={styles.text_b}>이용약관</p>
                  <p className={styles.text_b}>제 1장 총칙</p>
                  <p className={styles.text_b}>제 1 조 (목적)</p>
                  
                  <p>이 이용약관(이하 “약관”)은 Green Spot Finder(이하 “회사”라 합니다)과 이용 고객(이하 “회원”)간에 회사가 제공하는 Green Spot Finder 서비스(이하 “Green Spot Finder” 또는 “서비스”)를 회원이 이용함에 있어 회사와 회원간의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.</p>
                  
                  <p className={styles.text_b}>제 2 조 (약관의 효력 및 적용과 변경)</p>
                  
                  <p>(1) 이 약관은 Green Spot Finder 웹사이트 (www.greenspotfinder.com 이하 “Green Spot Finder 웹사이트”)에서 온라인으로 공시함으로써 효력을 발생하며, 합리적인 사유가 발생할 경우 관련법령에 위배되지 않는 범위 안에서 개정될 수 있습니다. 개정된 약관은 온라인에서 공지함으로써 효력을 발휘하며, 이용자의 권리 또는 의무 등 중요한 규정의 개정은사전에 공지합니다.</p>
                  <p>(2) 회사는 합리적인 사유가 발생될 경우에는 이 약관을 변경할 수 있으며, 약관을 변경할 경우에는 지체 없이 이를 사전에 공시합니다.</p>
                  <p>(3) 이 약관에 동의하는 것은 정기적으로 웹사이트를 방문하여 약관의 변경사항을 확인하는 것에 동의함을 의미합니다. 변경된 약관에 대한 정보를 알지 못해 발생하는 이용자의 피해는 회사에서 책임지지 않습니다.</p>
                  <p>(4) 회원은 변경된 약관에 동의하지 않을 경우 회원 탈퇴(해지)를 요청할 수 있으며, 변경된 약관의 효력 발생일로부터 7일 이후에도 거부의사를 표시하지 아니하고 서비스를 계속 사용할 경우 약관의 변경 사항에 동의한 것으로 간주됩니다.</p>

                  <p className={styles.text_b}>제 3 조 (약관 규정외 사항에 관한 준칙)</p>
                  <p>(1) 이 약관은 회사가 제공하는 개별서비스에 관한 이용안내(이하 “서비스별 안내”라 합니다)와 함께 적용합니다.</p>
                  <p>(2) 이 약관에 명시되지 아니한 사항에 대해서는 관계법령 및 서비스별 안내의 취지에 따라 적용할 수 있습니다.</p>

                  <p className={styles.text_b}>제 4 조 (용어의 정의)</p>
                  <p>(1) 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
                  <p>1. '이용고객'이라 함은 회원제서비스를 이용하는 이용자를 말합니다.</p>
                  <p>2. '이용계약'이라 함은 서비스 이용과 관련하여 회사와 이용고객 간에 체결 하는 계약 말합니다.</p>
                  <p>3. '이용자번호(ID)'라 함은 이용고객의 식별과 이용고객의 서비스 이용을 위하여 이용고객이 선정하고 회사가 부여하는 문자와 숫자의 조합을 말합니다.</p>
                  <p>4. '비밀번호'라 함은 이용고객이 부여 받은 이용자번호와 일치된 이용고객 임을 확인하고 이용고객의 권익보호를 위하여 이용고객이 선정한 문자와 숫자의 조합을 말합니다.</p>
                  <p>5. '단말기'라 함은 회사가 제공하는 서비스를 이용하기 위해 이용고객이 설치한 개인용 컴퓨터 및 모뎀 등을 말합니다.</p>
                  <p>6. '해지'라 함은 회사 또는 회원이 이용계약을 해약하는 것을 말합니다.</p>
                  <p>(2) 이 약관에서 사용하는 용어의 정의는 제1항에서 정하는 것을 제외하고는 관계법령 및 서비스별 안내에서 정하는 바에 의합니다.</p>
                  
                  <p className={styles.text_b}>제 2장 서비스 이용계약</p>
                  <p className={styles.text_b}>제 5 조 (이용 계약의 성립)</p>
                  <p>(1) 이용계약은 이용고객의 본 이용약관 내용에 대한 동의와 이용신청에 대하여 회사의 이용승낙으로 성립합니다.</p>
                  <p>(2) 본 이용약관에 대한 동의는 이용신청 당시 해당 Green Spot Finder 웹사이트의 “동의함” 버튼을 누름으로써 의사표시를 합니다.</p>
                  
                  <p className={styles.text_b}>제 6 조 (서비스 이용 신청)</p>
                  <p>(1) 회원으로 가입하여 본 서비스를 이용하고자 하는 이용고객은 회사에서 요청하는 제반정보(이름, 생년월일, 성별,연락처 등)를 제공하여야 합니다.</p>
                  <p>(2) 모든 회원은 반드시 회원 본인의 이름, 생년월일, 성별, 연락처를 제공하여야만 서비스를 이용할 수 있으며, 실명으로 등록하지 않은 사용자는 일체의 권리를 주장할 수 없습니다.</p>
                  <p>(3) 회원가입은 반드시 실명으로만 가입할 수 있으며 회사는 실명확인조치와 본인확인조치를 할 수 있습니다.</p>
                  <p>(4) 타인의 명의(이름, 생년월일, 성별)를 도용하여 이용신청을 한 회원의 모든 ID는 삭제되며, 관계법령에 따라 처벌을 받을 수 있습니다.</p>
                  <p>(5) 회사는 본 서비스를 이용하는 회원에 대하여 등급별로 구분하여 이용시간, 이용회수, 서비스 메뉴 등을 세분하여 이용에 차등을 둘 수 있습니다.</p>
                  
                  <p className={styles.text_b}>제 7 조 (개인정보의 보호 및 사용)</p>
                  <p>회사는 관계법령이 정하는 바에 따라 이용자 등록정보를 포함한 이용자의 개인정보를 보호하기 위해 노력합니다. 이용자 개인정보의 보호 및 사용에 대해서는 관련법령 및 회사의 "개인정보취급방침"이 적용됩니다. 단, 회사의 공식사이트이외의 웹에서 링크된 사이트에서는 회사의 "개인정보취급방침"이 적용되지 않습니다. 또한 회사는 이용자의 귀책사유로 인해 노출된 정보에 대해서 일체의 책임을 지지 않습니다.</p>
                  <p>회사는 관계법령이 정하는 바에 따라 이용자 등록정보를 포함한 이용자의 개인정보를 보호하기 위해 노력합니다. 이용자 개인정보의 보호 및 사용에 대해서는 관련법령 및 회사의 "개인정보취급방침"이 적용됩니다. 단, 회사의 공식사이트이외의 웹에서 링크된 사이트에서는 회사의 "개인정보취급방침"이 적용되지 않습니다. 또한 회사는 이용자의 귀책사유로 인해 노출된 정보에 대해서 일체의 책임을 지지 않습니다.</p>
                  
                  <p className={styles.text_b}>제 8 조 (이용 신청의 승낙과 제한)</p>
                  <p>(1) 회사는 제 6조의 규정에 의한 이용신청고객에 대하여 업무 수행상 또는 기술상 지장이 없는 경우에 원칙적으로 접수순서에 따라 서비스 이용을 승낙합니다.</p>
                  <p>(2) 회사는 아래사항에 해당하는 경우에 대해서 승낙하지 아니 합니다.</p>
                  <p>1. 실명이 아니거나 타인의 명의를 이용하여 신청한 경우</p>
                  <p>2. 이용계약 신청서의 내용을 허위로 기재한 경우</p>
                  <p>3. 사회의 안녕과 질서, 미풍양속을 저해할 목적으로 신청한 경우</p>
                  <p>4. 부정한 용도로 본 서비스를 이용하고자 하는 경우</p>
                  <p>5. 영리를 추구할 목적으로 본 서비스를 이용하고자 하는 경우</p>
                  <p>6. 기타 규정한 제반 사항을 위반하며 신청하는 경우</p>
                  <p>7. 본 서비스와 경쟁관계에 있는 이용자가 신청하는 경우</p>
                  <p>8. 기타 규정한 제반 사항을 위반하며 신청하는 경우</p>
                  <p>(3) 회사는 서비스 이용 신청이 다음 각 호에 해당하는 경우에는 그 신청에 대하여 승낙 제한사유가 해소될 때까지 승낙을 유보할 수 있습니다.</p>
                  <p>1. 회사가 설비의 여유가 없는 경우</p>
                  <p>2. 회사의 기술상 지장이 있는 경우</p>
                  <p>3. 기타 회사의 귀책사유로 이용 승낙이 곤란한 경우</p>
                  <p>(4) 회사는 이용신청고객이 관계법령에서 규정하는 미성년자일 경우에 서비스별 안내에서 정하는 바에 따라 승낙을 보류할 수 있습니다.</p>

                  <p className={styles.text_b}>제 9 조 (이용자ID 부여 및 변경 등)</p>
                  <p>(1) 회사는 이용고객에 대하여 약관에 정하는 바에 따라 이용자 ID를 부여합니다.</p>
                  <p>(2) 이용자ID는 원칙적으로 변경이 불가하며 부득이한 사유로 인하여 변경 하고자 하는 경우에는 해당 ID를 해지하고 재가입해야 합니다.</p>
                  <p>(3) Green Spot Finder의 이용자ID는 이용자 본인의 동의하에 KT&G가 운영하는 자사 사이트의 회원ID와 연동될 수 있습니다.</p>
                  <p>(4) 이용자ID는 다음 각 호에 해당하는 경우에는 이용고객 또는 회사의 요청으로 변경할 수 있습니다.</p>
                  <p>1. 이용자ID가 이용자의 전화번호 또는 생년월일 등으로 등록되어 사생활침해가 우려되는 경우</p>
                  <p>2. 타인에게 혐오감을 주거나 미풍양속에 어긋나는 경우</p>
                  <p>3. 기타 합리적인 사유가 있는 경우</p>
                  <p>(5) 서비스 이용자ID 및 비밀번호의 관리책임은 이용자에게 있습니다. 이를 소홀이 관리하여 발생하는 서비스 이용상의 손해 또는 제3자에 의한 부정이용 등에 대한 책임은 이용자에게 있으며 회사는 그에 대한 책임을 일절 지지않습니다.</p>
                  <p>(6) 기타 이용자 개인정보 관리 및 변경 등에 관한 사항은 서비스별 안내에 정하는 바에 의합니다.</p>

                  <p className={styles.text_b}>제3장 서비스의 이용</p>
                  <p className={styles.text_b}>제 10 조 (회사의 의무)</p>
                  <p>(1) 회사는 이용고객이 희망한 서비스 제공 개시일에 특별한 사정이 없는 한 서비스를 이용할 수 있도록 하여야 합니다.</p>
                  <p>(2) 회사는 계속적이고 안정적인 서비스의 제공을 위하여 설비에 장애가 생기거나 멸실된 때에는 부득이한 사유가 없는 한 지체없이 이를 수리 또는 복구합니다.</p>
                  <p>(3) 회사는 개인정보 보호를 위해 보안시스템을 구축하며 개인정보취급방침을 공시하고 준수합니다.</p>
                  <p>(4) 회사는 이용고객으로부터 제기되는 의견이나 불만이 정당하다고 객관적으로 인정될 경우에는 적절한 절차를 거쳐 즉시 처리하여야 합니다. 다만, 즉시 처리가 곤란한 경우는 이용자에게 그 사유와 처리일정을 통보하여야 합니다.</p>

                  <p className={styles.text_b}>제 11 조 (이용자의 의무)</p>
                  <p>(1) 이용자는 회원가입 신청 또는 회원정보 변경 시 실명으로 모든 사항을 사실에 근거하여 작성하여야 하며,허위 또는 타인의 정보를 등록할 경우 일체의 권리를 주장할 수 없습니다.</p>
                  <p>(2) 회원은 본 약관에서 규정하는 사항과 기타 회사가 정한 제반 규정, 공지사항 등 회사가 공지하는 사항 및 관계법령을 준수하여야 하며, 기타 회사의 업무에 방해가 되는 행위, 회사의 명예를 손상시키는 행위를 해서는 안됩니다.</p>
                  <p>(3) 회원은 주소, 연락처, 전자우편 주소 등 이용계약사항이 변경된 경우에 해당 절차를 거쳐 이를 회사에 즉시 알려야합니다.</p>
                  <p>(4) 회사가 관계법령 및 “개인정보취급방침”에 의거하여 그 책임을 지는 경우를 제외하고 회원에게 부여된 ID의 비밀번호 관리소홀, 부정사용에 의하여 발생하는 모든 결과에 대한 책임은 회원에게 있습니다.</p>
                  <p>(5) 회원은 회사의 사전 승낙 없이 서비스를 이용하여 영업활동을 할 수 없으며, 그 영업활동의 결과에 대해 회사는 책임을 지지 않습니다. 또한 회원은 이와 같은 영업활동으로 회사가 손해를 입은 경우, 회원은 회사에 대해 손해배상의무를 지며, 회사는 해당 회원에 대해 서비스 이용제한 및 적법한 절차를 거쳐 손해배상 등을 청구할 수 있습니다.</p>
                  <p>(6) 회원은 회사의 명시적 동의가 없는 한 서비스의 이용권한, 기타 이용계약상의 지위를 타인에게 양도, 증여할 수없으며 이를 담보로 제공할 수 없습니다.</p>
                  <p>(7) 회원은 회사 및 제 3자의 지적 재산권을 침해해서는 안됩니다.</p>
                  <p>(8) 회원은 다음 각 호에 해당하는 행위를 하여서는 안되며, 해당 행위를 하는 경우에 회사는 회원의 서비스 이용제한 및 적법 조치를 포함한 제재를 가할 수 있습니다.</p>
                  <p>1. 회원가입 신청 또는 회원정보 변경 시 허위내용을 등록하는 행위</p>
                  <p>2. 다른 이용자의 ID, 비밀번호, 생년월일 정보를 도용하는 행위</p>
                  <p>3. 이용자 ID를 타인과 거래하는 행위</p>
                  <p>4. 회사의 운영진, 직원 또는 관계자를 사칭하는 행위</p>
                  <p>5. 회사로부터 특별한 권리를 부여받지 않고 회사의 클라이언트 프로그램을 변경하거나, 회사의 서버를 해킹하거나, 웹사이트 또는 게시된 정보의 일부분 또는 전체를 임의로 변경하는 행위</p>
                  <p>6. 서비스에 위해를 가하거나 고의로 방해하는 행위</p>
                  <p>7. 본 서비스를 통해 얻은 정보를 회사의 사전 승낙 없이 서비스 이용 외의 목적으로 복제하거나, 이를 출판 및방송 등에 사용하거나, 제 3자에게 제공하는 행위</p>
                  <p>8. 공공질서 및 미풍양속에 위반되는 저속, 음란한 내용의 정보, 문장, 도형, 음향, 동영상을 전송, 게시, 전자우편등 기타의 방법으로 타인에게 유포하는 행위</p>
                  <p>9. 모욕적이거나 개인신상에 대한 내용이어서 타인의 명예나 프라이버시를 침해할 수 있는 내용을 전송, 게시,전자우편 등 기타의 방법으로 타인에게 유포하는 행위</p>
                  <p>10. 다른 이용자를 희롱 또는 위협하거나, 특정 이용자에게 지속적으로 고통 또는 불편을 주는 행위</p>
                  <p>11. 회사의 승인을 받지 않고 다른 사용자의 개인정보를 수집 또는 저장하는 행위</p>
                  <p>12. 범죄와 결부된다고 객관적으로 판단되는 행위</p>
                  <p>13. 본 약관을 포함하여 기타 회사가 정한 제반 규정 또는 이용 조건을 위반하는 행위</p>
                  <p>14. 기타 관계법령에 위배되는 행위</p>

                  <p className={styles.text_b}>제4장 계약당사자의 의무</p>
                  <p className={styles.text_b}>제 12 조 (서비스 이용 시간)</p>
                  <p>(1) 서비스 이용은 회사의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간 운영을 원칙으로 합니다. 단, 회사는 시스템 정기점검, 증설 및 교체를 위해 회사가 정한 날이나 시간에 서비스를 일시중단할 수 있으며,예정되어 있는 작업으로 인한 서비스 일시중단은 Green Spot Finder 웹사이트를 통해 사전에 공지합니다.</p>
                  <p>(2) 회사는 긴급한 시스템 점검, 증설 및 교체 등 부득이한 사유로 인하여 예고없이 일시적으로 서비스를 중단할 수 있으며, 새로운 서비스로의 교체 등 회사가 적절하다고 판단하는 사유에 의하여 현재 제공되는 서비스를 완전히 중단할 수 있습니다.</p>
                  <p>(3) 회사는 국가비상사태, 정전, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 정상적인 서비스 제공이 불가능 할 경우, 서비스의 전부 또는 일부를 제한하거나 중지할 수 있습니다. 다만 이 경우 그 사유 및 기간 등을 회원에게 사전 또는 사후에 공지합니다.</p>
                  <p>(4) 회사는 회사가 통제할 수 없는 사유로 인한 서비스중단의 경우(시스템관리자의 고의,과실없는 디스크장애, 시스템 다운 등)에 사전통지가 불가능하며 타인(PC통신회사, 기간통신사업자 등)의 고의, 과실로 인한 시스템중단 등의 경우에는통지하지 않습니다.</p>
                  <p>(5) 회사는 서비스를 특정범위로 분할하여 각 범위별로 이용가능시간을 별도로 지정할 수 있습니다. 다만 이 경우 그 내용을 공지합니다.</p>

                  <p className={styles.text_b}>제 13 조 (이용자ID 관리)</p>
                  <p>(1) 이용자ID와 비밀번호에 관한 모든 관리책임은 회원에게 있습니다.</p>
                  <p>(2) 회사는 이용자 ID에 의하여 제반 이용자 관리업무를 수행 하므로 회원이 이용자 ID를 변경하고자 하는 경우 회사가 인정할 만한 사유가 없는 한 이용자 ID의 변경을 제한할 수 있습니다.</p>
                  <p>(3) 이용고객이 등록한 이용자 ID 및 비밀번호에 의하여 발생되는 사용상의 과실 또는 제 3자에 의한 부정사용 등에 대한 모든 책임은 해당 이용고객에게 있습니다.</p>
                  
                  <p className={styles.text_b}>제 14 조 (게시물의 관리)</p>
                  <p>(1) 회사는 다음 각 호에 해당하는 게시물이나 자료를 사전통지 없이 삭제하거나 이동 또는 등록 거부를 할 수 있습니다.</p>
                  <p>1. 다른 회원 또는 제 3자에게 심한 모욕을 주거나 명예를 손상시키는 내용인 경우</p>
                  <p>2. 공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크시키는 경우</p>
                  <p>3. 불법복제 또는 해킹을 조장하는 내용인 경우</p>
                  <p>4. 영리를 목적으로 하는 광고일 경우</p>
                  <p>5. 범죄와 결부된다고 객관적으로 인정되는 내용일 경우</p>
                  <p>6. 다른 이용자 또는 제 3자의 저작권 등 기타 권리를 침해하는 내용인 경우</p>
                  <p>7. 회사에서 규정한 게시물 원칙에 어긋나거나, 게시판 성격에 부합하지 않는 경우</p>
                  <p>8. 회원의 게시물로 인한 법률상 이익 침해를 근거로, 다른 이용자 또는 제3자가 이용자 또는 회사를 대상으로 하여 민형사상의 법적 조치(예:고소,가처분 신청,손해배상 청구소송)를 취하는 동시에 법적 조치와 관련된 게시물의 삭제를 요청해오는 경우, 회사는 동 법적 조치의 결과(예: 검찰의 기소, 법원의 가처분결정, 손해 배상판결)가 있을 때까지 관련 게시물에 대한 접근을 잠정적으로 제한할 수 있습니다.</p>
                  <p>9. 기타 관계법령에 위배된다고 판단되는 경우</p>
                  
                  <p className={styles.text_b}>제 15 조 (게시물의 저작권 귀속과 책임)</p>
                  <p>(1) 회원이 서비스 화면 내에 게시한 게시물(글/그림/사운드/동영상)의 저작권은 게시한 회원에게 귀속됩니다. 따라서 게시물에 대한 저작권을 포함한 모든 권리 및 책임은 이를 게시한 회원에게 있습니다.</p>
                  <p>(2) 회사는 게시자의 동의 없이 게시물을 상업적으로 이용할 수 없으며, 다만 비영리 목적인 경우는 제외됩니다. 회사는 회원이 서비스에 게재 또는 등록한 게시물에 대한 이용권, 서비스상의 게재권 및 출판권 등을 가지며 게시물을 출판/판매 등의 방법으로 이용하고자 할 경우에는 사전에 공지를 통해서 회원에게 알려드리는 것을 원칙으로 합니다. (제 17조 게시물의 중단 및 재개 요청 항목을 참고하시기 바랍니다.)</p>
                  <p>(3) 저작물 이용 동의</p>
                  <p>Green Spot Finder 컨테스트에 출품한 수상작에 한하여 저작물에 대해 각 부분별 진행하는 연계프로그램과 관련하여 제공할 것을 동의해야 합니다.</p>
                  <p>1. Green Spot Finder 웹사이트, 연계사이트의 이용을 동의함 (단, 이 경우 회사는 회원의 별도 동의 없이는 회원의 아이디 를 제외한 개인정보를 제공할 수 없습니다.)</p>
                  <p>2. Green Spot Finder 프로그램의 지상파, IPTV 방영을 동의함</p>
                  <p>3. 인쇄매체(잡지, 신문 등)의 자료로 이용을 동의함</p>
                  <p>* 저작물은 상업적인 목적으로 사용하지 않음을 알려드립니다.</p>
                  
                  <p className={styles.text_b}>제 16 조 (회원 및 제 3자의 저작권 보호)</p>
                  <p>(1) 저작권자의 명시적 동의 없이 타인의 저작물의 전부 또는 일부를 복제, 배포, 전송 등의 방법으로 이용하는 것은 저작권자의 권리를 침해하는 행위임으로 복제, 배포, 전송 등의 방법으로 타인의 저작권을 침해하는 게시물을 서비스에 게재 또는 등록하여서는 아니 됩니다.</p>
                  <p>(2) 타인의 저작물을 인용한 게시물인 경우 그 인용부분이 회원 개인의 의견을 뒷받침하기 위해 일부 인용된 것이 아니라 게시물의 핵심적인 부분을 구성하고 있다면 출처를 밝히더라도 저작권 침해에 해당됨으로 저작권자의 명시적 동의 없이 이러한 게시물을 서비스에 게재 또는 등록하여서는 아니 됩니다.</p>
                  <p>(3) 회원은 공공질서나 미풍양속에 위배되는 내용과 타인의 저작권을 포함한 지적재산권 및 기타 권리를 침해하는 내용물에 대하여는 등록할 수 없으며, 만일 이와 같은 내용의 게시물로 인해 발생하는 결과에 대한 모든 책임은 게시물을 게시한 회원 본인에게 있습니다.</p>
                  <p>(4) 회원은 서비스를 이용하여 취득한 정보를 임의 가공, 판매하는 행위 등 서비스에 게재된 자료를 상업적으로 사용 할 수 없으며, 회원이 게시하는 게시물(회원간 전달 포함)등으로 인해 발생하는 손실이나 책임은 전적으로 게시물 을 게시한 회원에게 있고 회사의 고의가 아닌 한, 회사는 이에 대하여 책임지지 않습니다.</p>
                  <p>(5) 서비스상의 게시물은 회원들간의 지식공유를 위해 회원이 게재한 것이므로 회사는 게시물에 대한 정확성에 대해서는 보증을 하지 않습니다. 또한 회사는 회원들의 게시물 이용에 따른 동의절차를 중개하거나 그 과정에 개입 하지 않습니다.</p>
                  <p>(6) 회사는 회원이 게시하거나 등록하는 서비스 내의 내용물, 게시 내용에 대해 제 14조 각 호에 해당된다고 판단되는 경우 사전통지 없이 삭제하거나 이동 또는 등록 거부할 수 있습니다.</p>
                  
                  <p className={styles.text_b}>제 17 조 (게시물의 중단 및 재개요청)</p>
                  <p>(1) 게시물 중단 요청</p>
                  <p>회사의 서비스에 자신의 저작물이 게재되어 그 중단을 요청하려고 하는 회원(비회원 포함)은 다음의 자료들을 제출하여야 합니다.</p>
                  <p>1. 다음의 자료들 중 해당되는 자료 1부</p>
                  <p>가. 자신이 당해 게시물의 권리자로 표시된 저작권등록증 사본 또는 그에 상당하는 자료</p>
                  <p>나. 자신의 성명이나 명칭 또는 널리 알려진 이명(예:닉네임, ID, 약칭 등)이 표시되어 있는 저작물의 사본 또는 그에 상당하는 자료</p>
                  <p>다. 저작권법상의 저작권신탁관리업자인 경우 당해 게시물이 신탁관리대상임을 증명하는 자료</p>
                  <p>2. "가"의 자료와 함께 다음의 자료 각1부</p>
                  <p>가. 게시물이 자신의 저작권을 침해한다는 취지의 진술</p>
                  <p>나. 중단요구 대상이 되는 게시물의 제목 또는 제호</p>
                  <p>다. 회사가 게시물의 서비스상의 위치를 충분히 확인할 수 있는 정보(예 : 게시물이 위치하고 있는 URL 등)</p>
                  <p>라. 중단 요청자의 성명, 주소, 전화번호, 전자우편주소 등 연락처</p>
                  <p>마. 중단 요청자 또는 그 대리인의 서명 날인</p>
                  <p>바. 주장이 허위인 경우 그로 인하여 발생하는 법적 책임을 부담한다는 취지의 확인서</p>
                  <p>(2) 게시물의 중단 통보</p>
                  <p>회사는 게시물에 대한 게시중단요청이 있는 경우 다음의 사항을 기재한 우편물을 게시물의 게시가 중단된 날로부터 3일 이내에 게시물을 게시한 회원에게 발송하여 드립니다.</p>
                  <p>1. 당해 게시물이 중단된 일시</p>
                  <p>2. 당해 게시물의 제목 또는 제호</p>
                  <p>3. 중단요청자가 제출한 소명자료의 내용</p>
                  <p>4. 중단요청자의 성명, 주소, 전화번호, 전자우편주소 등 연락처</p>
                  <p>5. 자신의 게시물이 정당한 것임을 소명하기 위해 제출하여야 할 자료</p>
                  <p>(3) 게시물의 게시재개 요청</p>
                  <p>자신의 게시물이 중단된다는 통지를 받은 회원은 자신의 게시물이 정당한 것임을 소명하는 자료를 제출하여 그 재개를 요청할 수 있습니다.</p>
                  <p>자신의 게시물이 정당한 것임을 소명하기 위하여 제출하셔야 할 자료는 다음과 같습니다.</p>
                  <p>1. 다음의 자료들 중 해당되는 자료 1부</p>
                  <p>가. 당해 게시물의 재개를 요구하는 취지의 진술</p>
                  <p>나. 당해 게시물의 제목 또는 제호</p>
                  <p>다. 당해 게시물의 서비스상의 위치를 충분히 확인할 수 있는 정보(예 : 게시물이 위치하고 있는 URL)</p>
                  <p>라. 재개요청자의 성명, 주소, 전화번호, 전자우편주소 등 연락처</p>
                  <p>마. 재개 요청자 또는 그 대리인의 서명 날인</p>
                  <p>2. "1"의 자료와 함께 다음의 자료 각1부</p>
                  <p>가. 당해 게시물의 재개를 요구하는 취지의 진술</p>
                  <p>나. 당해 게시물의 제목 또는 제호</p>
                  <p>다. 당해 게시물의 서비스상의 위치를 충분히 확인할 수 있는 정보 (예 : 게시물이 위치하고 있는 URL)</p>
                  <p>라. 재개 요청자의 성명, 주소, 전화번호, 전자우편주소 등 연락처</p>
                  <p>마. 재개 요청자 또는 그 대리인의 서명 날인</p>
                  <p>바. 주장이 허위인 경우 그로 인하여 발생하는 법적 책임을 부담한다는 취지의 확인서</p>
                  <p>(4) 중단 게시물의 재개 통보</p>
                  <p>회사는 게시물의 게시중단에 따른 게시자의 게시재개요청이 있는 경우 다음의 사항을 기재한 우편물을 중단 요청자에게 발송하여 드립니다.</p>
                  <p>1. 재개할 게시물의 제목 또는 제호</p>
                  <p>2. 재개요청자가 제출한 소명자료의 내용</p>
                  <p>3. 재개요청자의 성명, 주소, 전화번호, 전자우편주소 등 연락처</p>
                  <p>4. 당해 게시물의 재개 예정일</p>
                  <p>재개 예정일은 당해 재개요청자의 요구를 받은 날로부터 7일 이후 14일 이내에 재개합니다.</p>
                  <p>* 중단(재개)요청</p>
                  <p>회사가 제공하는 서비스에 회원(비회원 포함)의 저작권을 침해하는 게시물이 게재된 경우 그 중단 또는 재개는 아래의 개인정보 관리책 임자에게 연락 주시기 바랍니다.</p>
                  
                  <p className={styles.text_b}>제 5 장 계약의 해지 및 이용제한</p>
                  <p className={styles.text_b}>제 18 조 (계약 변경 및 해지)</p>
                  <p>회원이 이용계약을 해지하고자 하는 때에는 회원 본인이 Green Spot Finder 웹사이트 내의 “회원탈퇴” 메뉴를 이용해 가입해지를 해야 합니다.</p>
                  
                  <p className={styles.text_b}>제 19 조 (서비스 이용제한)</p>
                  <p>(1) 회사는 회원이 서비스 이용내용에 있어서 본 약관 제 11조 내용을 위반하거나, 다음 각 호에 해당하는 경우 서비스 이용을 제한할 수 있습니다.</p>
                  <p>1. 미풍양속을 저해하는 비속한 ID 및 별명 사용</p>
                  <p>2. 타 이용자에게 심한 모욕을 주거나, 서비스 이용을 방해한 경우</p>
                  <p>3. 기타 정상적인 서비스 운영에 방해가 될 경우</p>
                  <p>4. 정보통신 윤리위원회 등 관련 공공기관의 시정 요구가 있는 경우</p>
                  <p>5. 3개월 이상 서비스를 이용한 적이 없는 경우</p>
                  <p>6. 게시판에 자료만 올려 놓고 파일 자료실과 같은 개인용도로 이용하는 경우</p>
                  <p>7. 불법 자료를 업로드 한 경우</p>
                  <p>가. 상용소프트웨어나 크랙파일을 올린 경우</p>
                  <p>나. 정보통신윤리 위원회의 심의 세칙 제 7조에 어긋나는 음란물을 게재한 경우</p>
                  <p>다. 반국가적 행위의 수행을 목적으로 하는 내용을 포함한 경우</p>
                  <p>라. 저작권이 있는 글을 무단 복제하거나 mp3를 게시판에 올린 경우</p>
                  <p>(2) 상기 이용제한 규정에 따라 서비스를 이용하는 회원에게 서비스 이용에 대하여 별도 공지 없이 서비스 이용의 일시정지, 초기화, 이용계약 해지 등을 불량이용자 처리규정에 따라 취할 수 있습니다.</p>
                  
                  <p className={styles.text_b}>제 6 장 손해배상 및 기타사항</p>
                  <p className={styles.text_b}>제 20 조 (손해배상)</p>
                  <p>회사는 서비스에서 무료로 제공하는 서비스의 이용과 관련하여 개인정보취급방침에서 정하는 내용에 해당하지 않는 사항에 대하여는 어떠한 손해도 책임을 지지 않습니다.</p>
                  
                  <p className={styles.text_b}>제 21 조 (면책조항)</p>
                  <p>(1) 회사는 천재지변, 전쟁 및 기타 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공 에 대한 책임이 면제됩니다.</p>
                  <p>(2) 회사는 기간통신 사업자가 전기통신 서비스를 중지하거나 정상적으로 제공하지 아니하여 손해가 발생한 경우 책임이 면제됩니다.</p>
                  <p>(3) 회사는 서비스용 설비의 보수, 교체, 정기점검, 공사 등 부득이한 사유로 발생한 손해에 대한 책임이 면제됩니다.</p>
                  <p>(4) 회사는 회원의 귀책사유로 인한 서비스 이용의 장애 또는 손해에 대하여 책임을 지지 않습니다.</p>
                  <p>(5) 회사는 이용자의 컴퓨터 오류에 의해 손해가 발생한 경우, 또는 회원이 신상정보 및 전자우편 주소를 부실하게 기재하여 손해가 발생한 경우 책임을 지지 않습니다.</p>
                  <p>(6) 회사는 회원이 서비스를 이용하여 기대하는 수익을 얻지 못하거나 상실한 것에 대하여 책임을 지지 않습니다.</p>
                  <p>(7) 회사는 회원이 서비스를 이용하면서 얻은 자료로 인한 손해에 대하여 책임을 지지 않습니다. 또한 회사는 회원이 서비스를 이용하며 타 회원으로 인해 입게 되는 정신적 피해에 대하여 보상할 책임을 지지 않습니다.</p>
                  <p>(8) 회사는 회원이 서비스에 게재한 각종 정보, 자료, 사실의 신뢰도, 정확성 등 내용에 대하여 책임을 지지 않습니다.</p>
                  <p>(9) 회사는 이용자 상호간 및 이용자와 제 3자 상호 간에 서비스를 매개로 발생한 분쟁에 대해 개입할 의무가 없으며,이로 인한 손해를 배상할 책임도 없습니다.</p>
                  <p>(10) 회사에서 회원에게 무료로 제공하는 서비스의 이용과 관련해서는 어떠한 손해도 책임을 지지 않습니다.</p>
                  
                  <p className={styles.text_b}>제 22 조 (재판권 및 준거법)</p>
                  <p>(1) 이 약관에 명시되지 않은 사항은 정보통신방법 등 관계법령과 상관습에 따릅니다.</p>
                  <p>(2) 회사의 정액 서비스 회원 및 기타 유료 서비스 이용 회원의 경우 회사가 별도로 정한 약관 및 방침에 따릅니다.</p>
                  <p>(3) 서비스 이용으로 발생한 분쟁에 대해 소송이 제기되는 경우 회사의 본사 소재지를 관할하는 법원을 관할 법원으로 합니다.</p>
                  <p>제 7 장 구매계약</p>
                  
                  <p className={styles.text_b}>제 23 조</p>
                  <p>"Green Spot Finder" 이용자는 "Green Spot Finder" 상에서 다음 또는 이와 유사한 방법에 의하여 구매를 신청하며, "Green Spot Finder"은 이용자가 구매신청을 함에 있어서 다음의 각 내용을 알기 쉽게 제공하여야 합니다. 단, 회원인 경우 제2호 내지 제4호의 적용을 제외할 수 있습니다.</p>
                  <p>(1) 재화등의 검색 및 선택</p>
                  <p>(2) 성명, 주소, 전화번호, 전자우편주소(또는 이동전화번호) 등의 입력</p>
                  <p>(3) 약관내용, 청약철회권이 제한되는 서비스, 배송료·설치비 등의 비용부담과 관련한 내용에 대한 확인</p>
                  <p>(4) 이 약관에 동의하고 위 3.호의 사항을 확인하거나 거부하는 표시(예, 마우스 클릭)</p>
                  <p>(5) 재화등의 구매신청 및 이에 관한 확인 또는 "애니바로"의 확인에 대한 동의</p>
                  <p>(6) 결제방법의 선택</p>
                  
                  <p className={styles.text_b}>제 24 조 (계약의 성립)</p>
                  <p>(1) "Green Spot Finder"는 제 23조와 같은 구매신청에 대하여 다음 각호에 해당하면 승낙하지 않을 수 있습니다.</p>
                  <p>다만, 미성년자와 계약을 체결하는 경우에는 법정대리인의 동의를 얻지 못하면 미성년자 본인 또는 법정대리인이 계약을 취소할 수 있다는 내용을 고지하여야 합니다.</p>
                  <p>1. 신청 내용에 허위, 기재누락, 오기가 있는 경우</p>
                  <p>2. 미성년자가 담배, 주류 등 청소년보호법에서 금지하는 재화 및 용역을 구매하는 경우</p>
                  <p>3. 기타 구매신청에 승낙하는 것이 "Green Spot Finder"의 기술상 현저히 지장이 있다고 판단하는 경우</p>
                  <p>(2) "Green Spot Finder"의 승낙이 제26조 제1항의 수신확인통지형태로 이용자에게 도달한 시점에 계약이 성립한 것으로 봅니다.</p>
                  <p>(3) "Green Spot Finder"의 승낙의 의사표시에는 이용자의 구매 신청에 대한 확인 및 판매가능 여부, 구매신청의 정정 취소 등에 관한 정보 등을 포함하여야 합니다.</p>
                  <p>[대금결제]</p>
                  
                  <p className={styles.text_b}>제 25 조 (지급방법)</p>
                  <p>"Green Spot Finder"에서 구매한 재화 또는 용역에 대한 대금지급방법은 다음 각호의 방법 중 가용한 방법으로 할 수 있습니다.</p>
                  <p>단, "Green Spot Finder"은 이용자의 지급방법에 대하여 재화 등의 대금에 어떠한 명목의 수수료도 추가하여 징수할 수 없습니다.</p>
                  <p>(1) 폰뱅킹, 인터넷뱅킹, 메일 뱅킹 등의 각종 계좌이체</p>
                  <p>(2) 선불카드, 직불카드, 신용카드 등의 각종 카드 결제</p>
                  <p>(3) 온라인무통장입금</p>
                  <p>(4) 전자화폐에 의한 결제</p>
                  <p>(5) 수령시 대금지급</p>
                  <p>(6) 쿠폰 등 "Green Spot Finder"이 지급한 포인트에 의한 결제</p>
                  <p>(7) "Green Spot Finder"과 계약을 맺었거나 "Green Spot Finder"이 인정한 상품권에 의한 결제</p>
                  <p>(8) 기타 전자적 지급 방법에 의한 대금 지급 등</p>
                  
                  <p className={styles.text_b}>제 26 조 (수신확인통지ㆍ구매신청 변경 및 취소)</p>
                  <p>(1) "Green Spot Finder"은 이용자의 구매신청이 있는 경우 이용자에게 수신확인통지를 합니다.</p>
                  <p>(2) 수신확인통지를 받은 이용자는 의사표시의 불일치 등이 있는 경우에는 수신확인통지를 받은 후 즉시 구매신청 변경 및 취소를 요청할 수 있고 "Green Spot Finder"은 배송 전에 이용자의 요청이 있는 경우에는 지체 없이 그 요청에 따라 처리하여야 합니다.</p>
                  <p>다만 이미 대금을 지불한 경우에는 제19조의 청약철회 등에 관한 규정에 따릅니다.</p>
                  <p>[배송,취소,환불]</p>
                  <p className={styles.text_b}>제 27 조 ("서비스"의 변경)</p>
                  <p>(1) "Green Spot Finder"은 이용자와 재화 등의 공급시기에 관하여 별도의 약정이 없는 이상, 이용자가 청약을 한 날부터 7일 이내에 재화 등을 배송할 수 있도록 주문제작, 포장 등 기타의 필요한 조치를 취합니다. 다만, "Green Spot Finder"이 이미 재화 등의 대금의 전부 또는 일부를 받은 경우에는 대금의 전부 또는 일부를 받은 날부터 3영업일 이내에 조치를 취합니다. 이때 "Green Spot Finder"이용자가 재화등의 공급 절차 및 진행 사항을 확인할 수 있도록 적절한 조치를 합니다.</p>
                  <p>(2) "Green Spot Finder"은 이용자가 구매한 재화에 대해 배송수단, 수단별 배송비용 부담자, 수단별 배송기간 등을 명시합니다. 만약 "Green Spot Finder"이 약정 배송기간을 초과한 경우에는 그로 인한 이용자의 손해를 배상하여야 합니다. 다만 "Green Spot Finder"이 고의, 과실이 없음을 입증한 경우에는 그러하지 아니합니다.</p>
                  
                  <p className={styles.text_b}>제 28 조 (구매신청)</p>
                  <p>"Green Spot Finder"은 이용자가 구매 신청한 재화 등이 품절 등의 사유로 인도 또는 제공을 할 수 없을 때에는 지체 없이 그 사유를 이용자에게 통지하고 사전에 재화 등의 대금을 받은 경우에는 대금을 받은 날부터 3영업일 이내에 환급하거나 환급에 필요한 조치를 취합니다.</p>
                  
                  <p className={styles.text_b}>제 29 조 (청약철회)</p>
                  <p>(1) "Green Spot Finder"과 재화 등의 구매에 관한 계약을 체결한 이용자는 수신확인의 통지를 받은 날부터 7일 이내에는 청약의 철회를 할 수 있습니다.</p>
                  <p>(2) 이용자는 재화 등을 배송 받은 경우 다음 각호의 1에 해당하는 경우에는 반품 및 교환을 할 수 없습니다.</p>
                  <p>1. 이용자에게 책임 있는 사유로 재화 등이 멸실 또는 훼손된 경우(다만, 재화 등의 내용을 확인하기 위하여 포장 등을 훼손한 경우에는 청약철회를 할 수 있습니다)</p>
                  <p>2. 이용자의 사용 또는 일부 소비에 의하여 재화 등의 가치가 현저히 감소한 경우</p>
                  <p>3. 시간의 경과에 의하여 재판매가 곤란할 정도로 재화 등의 가치가 현저히 감소한 경우</p>
                  <p>4. 같은 성능을 지닌 재화 등으로 복제가 가능한 경우 그 원본인 재화 등의 포장을 훼손한 경우</p>
                  <p>(3) 제2항 제2호 내지 제4호의 경우에 "Green Spot Finder"이 사전에 청약철회 등이 제한되는 사실을 소비자가 쉽게 알 수 있는 곳에 명기하거나 시용상품을 제공하는 등의 조치를 하지 않았다면 이용자의 청약철회 등이 제한되지 않습니다.</p>
                  <p>(4) 이용자는 제1항 및 제2항의 규정에 불구하고 재화 등의 내용이 표시·광고 내용과 다르거나 계약내용과 다르게 이행된 때에는 당해 재화 등을 공급받은 날부터 3월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에 청약철회 등을 할 수 있습니다.</p>
                  
                  <p className={styles.text_b}>부 칙</p>
                  
                  <p>(시행일) 본 약관은 2024년 11월 5일부터 적용됩니다.</p>
                  
                  <p>2024년 11월 5일부터 시행되던 종전의 약관은 본 약관으로 대체합니다.</p>
               </div>
            </div>
         </div>
      </>
   );
}

export default TermsOfUse;