import React from 'react';
import commons from '../../styles/common.module.css';
import styles from '../../styles/privacy/privacy.module.css';
import useDocumentTitle from '../../hooks/useDocumentTitle';

function Privacy(props) {
   const { mainTitle } = useDocumentTitle();

   return (
      <>
         <div className={commons.container__box}>
            <h2 className={commons.main_title}>{mainTitle}</h2>
               
            <div className={styles.layout}>
               <div className={styles.text_layout}>
                  {/* 개인 정보 수집 · 이용에 대한 안내 */}
                  <p className={styles.text_b}>개인 정보 수집 · 이용에 대한 안내</p>
                  
                  <p>수집하는 개인정보의 항목</p>
                  <p>가. Green Spot Finder 는 회원가입, 원활한 고객상담, 각종 서비스의 제공을 위해 최초 회원가입 당시 아래와 같은 최소한의 개인정보를 필수항목으로 수집하고 있습니다.</p>
                  <p className={styles.text_mg0}>[일반 회원가입]</p>
                  <p>- 성명, 생년월일, 성별, 아이디, 비밀번호, 연락처(메일주소, 휴대폰 번호), 가입인증정보</p>
                  <p className={styles.text_mg0}>[외국인 일반 회원가입]</p>
                  <p>- 성명, 생년월일, 성별, 아이디, 비밀번호, 연락처(메일주소, 휴대폰 번호), 가입인증정보</p>
                  <p className={styles.text_mg0}>[외국인 실명확인 회원가입]</p>
                  <p>- 국내 외국인 가입자 : 성명, 실명인증값, 아이디, 비밀번호, 별명, 연락처(메일주소, 휴대폰 번호 중 택일), 생년월일, 성별, 외국인등록번호로 실명인증한 자는 국적, 만 14세 미만은 법정대리인정보. 가입인증정보</p>
                  <p>
                     - 해외 외국인 가입자 : 성명, 아이디, 비밀번호, 별명, 연락처(메일주소, 휴대폰 번호 중 택일), 국적, 성별, 생년월일, 가입인증정보
                     서비스 이용과정에서 아래와 같은 정보들이 자동으로 생성되어 수집될 수 있습니다.
                  </p>
                  <p>
                     - IP Address, 쿠키, 방문 일시, 서비스 이용 기록, 불량 이용 기록
                     다. 부가 서비스 및 맞춤식 서비스 이용 과정에서 해당 서비스의 이용자에 한해서만 아래와 같은 정보들이 수집될 수 있습니다.
                  </p>
                  <p>
                     - 주소, 연락처, 사용 이동통신사, 계좌번호 등
                     라. 유료 서비스 이용 과정에서 아래와 같은 결제 정보들이 수집될 수 있습니다.
                  </p>
                  <p>- 신용카드 결제시 : 카드사명, 카드번호 등</p>
                  <p>- 휴대전화 결제시 : 이동전화번호, 통신사, 결제승인번호 등</p>
                  <p>- 계좌이체시 : 은행명, 계좌번호 등</p>
                  <p>- 상품권 이용시 : 상품권 번호</p>

                  <p className={styles.text_b}>개인정보의 수집 및 이용 목적</p>
                  <p>가. 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산 컨텐츠 제공, 특정 맞춤 서비스 제공, 물품배송 또는 청구서 등 발송, 본인인증, 구매 및 요금 결제, 요금추심</p>
                  <p>나. 회원관리 회원제 서비스 이용 및 제한적 본인 확인제에 따른 본인확인, 개인식별, 불량회원의 부정 이용방지와 비인가 사용방지, 가입의사 확인, 가입 및 가입횟수 제한, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달</p>
                  <p>다. 신규 서비스 개발 및 마케팅·광고에의 활용 신규 서비스 개발 및 맞춤 서비스 제공, 통계학적 특성에 따른 서비스 제공 및 광고 게재, 서비스의 유효성 확인, 이벤트 및 광고성 정보 제공 및 참여기회 제공, 접속빈도 파악, 회원의 서비스 이용에 대한 통계</p>

                  {/* 개인정보 취급 위탁 동의 */}
                  <p className={styles.text_b}>개인정보 취급 위탁 동의</p>
                  <p>회원가입을 위해 아래와 같이 개인정보를 위탁하고 있으며, 관계 법령에 따라 위탁 계약 시 개인정보가 안전하게 관리될 수 있도록 필요한 사항을 규정하고 있습니다.</p>
                  <p>수탁업체 : 왓에버서치</p>
                  <p>위탁업무내용 : 회원가입</p>
                  <p>개인정보의 보유·이용기간 : 처리목적 달성 시 또는 위탁계약 종료시까지</p>

                  <p className={styles.text_b}>개인정보의 보유 및 이용기간</p>
                  <p>이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다.</p>
                  <p>
                     가. Green Spot Finder 내부 방침에 의한 정보보유 사유
                     - 부정이용기록 보존 이유 : 부정 이용 방지 보존 기간 : 1년
                  </p>
                  <p>나. 관련법령에 의한 정보보유 사유 상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우 Green Spot Finder는 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다. 이 경우 Green Spot Finder는 보관하는 정보를 그 보관의 목적으로만 이용하며 보존기간은 아래와 같습니다.</p>
                  <p className={styles.text_mg0}>- 웹사이트 방문기록</p>
                  <p>보존 이유 : 통신비밀보호법 보존 기간 : 3개월</p>
                  <p className={styles.text_mg0}>- 본인확인에 관한 기록</p>
                  <p>보존 이유 : 정보통신망 이용촉진 및 정보보호 등에 관한 법률</p>
                  <p>보존 기간 : 6개월</p>
                  <p className={styles.text_mg0}>- 소비자의 불만 또는 분쟁처리에 관한 기록</p>
                  <p>보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률</p>
                  <p>보존 기간 : 3년</p>
                  <p className={styles.text_mg0}>- 계약 또는 청약철회 등에 관한 기록</p>
                  <p>보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률</p>
                  <p>보존 기간 : 5년</p>
                  <p className={styles.text_mg0}>- 대금결제 및 재화 등의 공급에 관한 기록</p>
                  <p>보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률</p>
                  <p>보존 기간 : 5년</p>
               </div>
            </div>
         </div>
      </>
   );
}

export default Privacy;